Laine Tsujii 
Bellevue, WA. 
98004
www.linkedin.com/in/lainetsujii
ltsujii@aol.com



425-449-8559(O)
425-260-6667(M)
Summary
My passion is learning, representing and delivering enterprise solutions that meet customer requirements and expectations. My focus has been to help plan/design storage solutions for enterprise applications that include assessing performance, availability, recoverability and capacity objectives. 

Delivery mechanisms include: customer presentations, webinars, white-boarding, proposals, user conferences, tech papers, and workshops. 

* Storage Architectures and Management Tools
* Virtualized Servers  and Storage 
* Microsoft Enterprise Applications
* High performance/low latency solutions
* CIFS/NFS/NAS, scalable file systems
* Fibre Channel/iSCSI/SAS 
* High availability clustering and load balancing
* Backup, Recovery and Archiving
* Hyper Converged Infrastructures
* Cloud architectures- hybrid, public, privateExperience2013-Present                  DellEMC                          Bellevue, WA
Advisory Systems Engineer
* Deliver presales technical guidance for the entire DellEMC portfolio 
* Provide architectural guidance for DellEMC Federation of technologies including VMWare, Pivotal, and RSA security
* Assist customers and account teams with Microsoft enterprise technology guidance
* Support product/technology information workshops, large customer technical relationships, and product feature requests
* Focus on scale-out NAS, FC/iSCSI SAN, Flash arrays, storage virtualization, cloud services, and converged infrastructure
* Use cases include: high performance/low latency databases, VDI, Big Data/Data Lakes, hybrid cloud integration, and storage efficiencies
1999–2013	Dell, Inc.	Bellevue, WA
Enterprise Technologist
* Provide presales technical architectural and strategy support covering the entire Dell storage portfolio.  
* Focus on application workload sizing and optimization, consolidation and virtualization on Dell Compellent, Equallogic and PowerVault SANs, and Fluid File System Scalable NAS platforms. 
* Serve as field liaison to Product Group engineering and marketing teams
* Presenter at 2012 Dell Storage Forum and 2013 Dell  Technical Summit
* Trained field SE’s and Sales Specialists on application optimization, sizing  and protection. Emphasis on Exchange, SQL Server, Sharepoint, Hyper-V and VMWare.
Storage Presales Design Architect
* 2010-Providing architectural and performance design support for all lines of storage products to field storage specialists and consultants.
* Primary focus on storage design and analysis support for SAN, NAS, DAS, archival and backup systems for Windows, Linux, UNIX and ESX hosts.
* Produce storage performance, utilization and capacity planning reports to enable sales teams to guide customers to optimal solutions.
* Support sales engagements where subject-matter expertise is required.
Enterprise Technologist
* 2007- Designing solutions for Microsoft enterprise technologies including Exchange, SQL, Sharepoint and Windows servers and emerging technologies- Hyper-V, Unified Communications/Lync, Business Continuance, Backup and Archiving.
* 2001- Technical pre-sales focus on Storage Technologies including Dell and EMC SAN, NAS, iSCSI, Fibre Channel, SAS, Scalable File Systems and Data Backup systems
* Presenter at customer and internal training events, con calls and webcasts on enterprise storage solutions
* Support Field Sales engagements across all business segments
* Moderate storage response forums to address technical issues for field account teams; Write technical and business sales support papers
* 1999- Hired as Systems Consultant-Global, assigned to Dell’s largest enterprise account.  Helped expand Enterprise Revenue to over $30 million and 40% marketshare.
* In 2000, won largest unit Clustered Server SAN and 8-way server projects in key customer development Labs; won largest single server/multi-array SAN at large Internet service provider.
* Named Global SC of the Quarter for Q4 FY00
* Dell Certified in Dell|EMC and PowerVault SAN, OpenManage, SQL/Exchange, WAFS, Windows Storage Server and EMC Celerra NAS. 1996–1999	CompuCom Systems, Inc.	Bellevue, WA
Professional Services Manager
* Increased Area SE Billable Revenues to over $11 million
* Managed and grew staff to 42 Systems Engineers, Project Managers and Systems Consultants.
* Implemented Project-based engagements — increasing profitability.
* Certified in Compaq StorageWorks SANs
* Named to 1998 President’s Club as one of top producers out of 100 branches1989–1996	Compaq Computer Corporation	Bellevue, WA
Regional Alliances Manager/Systems Engineer
* 1996 Managed Partner Alliances across West Region- partners included ISVs, Systems Integrators, Consulting Firms, and IHV peripherals. 
* 1989-1995 Sr. Systems Advisory Engineer and Dealer Management SE in PNW Area
* Led field effort to bring to market Compaq’s first Rack-based server, later named the ProLiant.  
* Helped drive revenues at Microsoft account from $2M to over 50M
* Managed Channel and Reseller technical training and pre-sales technical support for Northwest region.
* Certified in Microsoft, Novell, Compaq, and SCO UNIX
* Named to 1994 President’s Club as one of top SE’s in N. America1986–1989	BusinessLand, Inc.	Bellevue, WA
Systems Engineer
* Multi-Branch LAN and Server Technical Sales Support 
* Named to 1988 100% Club 
* Certified in IBM, Compaq, Novell, 3Com, Apple, and NexT Step EducationUniversity of Washington	Seattle, WA
* B.A., EconomicsInterestsUSTA tennis captain/player, road biking, Hi-Tech/Computers


 

